<a href="https://colab.research.google.com/github/Riturajkumari/skills_basic_python/blob/main/SQL_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**what is a DataBase? Difference between SQL and NoSQl database?**

A **database** is an organized collection of data, so that it can be easily accessed and managed.
 - data into tables, rows, columns, and index it to make it easier to find relevant information.
    - databases available like MySQL, Sybase, Oracle, MongoDB, Informix, PostgreSQL, SQL Server, etc.

- difference between SQL and NOSQL database.

 **SQL**
  - RELATIONAL DATABASE MANAGEMENT SYSTEM (RDBMS)
  - These databases have fixed or static or predefined schema
  - These databases are not suited for hierarchical data storage.
  - These databases are best suited for complex queries
  - Vertically Scalable
  - Follows ACID property
  - Examples: MySQL, PostgreSQL, Oracle, MS-SQL Server, etc

**NoSQL**
 
   - Non-relational or distributed database system.
   - They have dynamic schema
   - These databases are best suited for hierarchical data storage.
   - These databases are not so good for complex queries
   - Horizontally scalable
   - Follows CAP(consistency, availability, partition tolerance)
   - Examples: MongoDB, GraphQL, HBase, Neo4j, Cassandra, etc

2.**what is DDL ? Explain why CREATE, DROP, ALTER, and TRUNCATE are used with an example?**

- Data Definition Language(DDL) is a subset of SQL and a part of DBMS(Database Management System). DDL consist of Commands to commands like CREATE, ALTER, TRUNCATE and DROP.
- DDL Commands :
   - **Create**
This command is used to create a new table in SQL. The user has to give information like table name, column names, and their datatypes.
   - CREATE TABLE table_name

(column_1 datatype,
column_2 datatype,
column_3 datatype,
....
);

   **ALTER**
   - This command is used to add, delete or change columns in the existing table. The user needs to know the existing table name and can do add, delete or modify tasks easily.
      cammand:
       ALTER TABLE table_name
       ADD column_name datatype; 

    **TRUNCATE**
       
       This command is used to remove all rows from the table, but the structure of the table still exists.
       TRUNCATE TABLE table_name;
    **DROP** 
      This command is used to remove an existing table along with its structure from the Database.
           DROP TABLE table_name;

In [ ]:
# example
# create Student information

CREATE TABLE Student_info
(
College_Id number(2),
College_name varchar(30),
Branch varchar(10)
);

In [ ]:
# Alter command example

ALTER TABLE Student_info
ADD CGPA number;

In [ ]:
# DROP EXample

DROP TABLE Student_info;

**what is DML? Explain INSERT, UPDATE and DELETE with an example?**

 **DML** is an abbreviation of Data Manipulation Language.
  The DML commands in Structured Query Language change the data present in the SQL database. We can easily access, store, modify, update and delete the existing records from the database using DML commands.

    INSERT DML Command

     INSERT is another most important data manipulation command in Structured Query Language, which allows users to insert data in database tables.

     *Syntax*
     INSERT INTO TABLE_NAME ( column_Name1 , column_Name2 , column_Name3 , .... column_NameN )  VALUES (value_1, value_2, value_3, .... value_N ) ;

In [ ]:
# Example 1: This example describes how to insert the record in the database table.

INSERT INTO Student (Stu_id, Stu_Name, Stu_Marks, Stu_Age) VALUES (104, Anmol, 89, 19);

**UPDATE**
 UPDATE is another most important data manipulation command in Structured Query Language, which allows users to update or modify the existing data in database tables.

   **Syntax**
UPDATE Table_name SET [column_name1= value_1, â€¦.., column_nameN = value_N] WHERE CONDITION;

In [ ]:
# Suppose, you want to update the Product_Price of the product whose Product_Id is P102. To do this, you have to write the following DML UPDATE command:

 - UPDATE Product SET Product_Price = 80 WHERE Product_Id = 'P102' ;

In [ ]:
# Example 2: This example describes how to update the value of multiple fields of the database table.

- UPDATE Student SET Stu_Marks = 80, Stu_Age = 21 WHERE Stu_Id = 103 AND Stu_Id = 202;

**DELETE DML Command**
 DELETE is a DML command which allows SQL users to remove single or multiple existing records from the database tables.
  *syntax*
  DELETE FROM Table_Name WHERE condition;

In [ ]:
# Example 1: This example describes how to delete a single record from the table.

DELETE FROM Product WHERE Product_Id = 'P202' ;

**What is DQL? Explain SELECT, with an example?**

- It is used for retrieving data. A user can retrieve data according to requirements using the select command. 

Example: 

If a user wants to retrieve all the from the employee table, the query must be given as follows: 
 
select *
from employee;

 Example . If a user wants to know the average salary of the employees, the query must be given as follows: 
 

select avg(salary) 
from employee;

In [ ]:
# If a user wants to know the name of the employee whose salary is less than 10, 000; the query is

select ename 
from employee 
where salary<=10, 000;

**Explain Primary key and Foreign Key**.

- **Primary Key**: A primary key is used to ensure that data in the specific column is unique. A column cannot have NULL values. It is either an existing table column or a column that is specifically generated by the database according to a defined sequence. 
    - *Example:STUD_NO, as well as STUD_PHONE both, are candidate keys for relation STUDENT but STUD_NO can be chosen as the primary key (only one out of many candidate keys).*

**Foreign Key:**
   A foreign key is a column or group of columns in a relational database table that provides a link between data in two tables. It is a column (or columns) that references a column (most often the primary key) of another table. 
   
     - STUD_NO in STUDENT_COURSE is a foreign key to STUD_NO in STUDENT relation.

**Write a python code to connect MYSQL to python . Explain the cursor() and execute() method.**

In [ ]:
pip install mysql-connector python

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Requirement already satisfied: mysql-connector in /usr/local/lib/python3.8/dist-packages (2.2.9)
ERROR: Could not find a version that satisfies the requirement python (from versions: none)
ERROR: No matching distribution found for python

In [ ]:
import mysql.connector
# import mysql.connector
#create user 'user'@'%' identified by 'password'
mydb = mysql.connector.connect(
  host="localhost",
  user="abc",
  password="password"
)
print(mydb)
mycursor = mydb.cursor()
mycursor.execute("SHOW DATABASE")
for x in mycursor:
  print(x)

**Give the order of execution of SQL clauses in an SQL query.**

*Different clauses available in the Structured Query Language are as follows:*
- WHERE CLAUSE
- GROUP BY CLAUSE
- HAVING CLAUSE
- ORDER BY CLAUSE

Syntax of where clause with a select query to retrieve all the column values for every record from a table:
 SELECT * FROM employees WHERE Salary > 50000;

Syntax GROUP BY

SELECT * FROM TABLENAME GROUP BY COLUMNNAME;

- HAVING CONDITION

TABLENAME GROUP BY COLUMNNAME HAVING CONDITION;

ORDER BY CLAUSE

- Syntax of ORDER BY clause without asc and desc keyword:
SELECT COLUMN_NAME1, COLUMN_NAME2 FROM TABLE_NAME ORDER BY COLUMNAME;  

- Syntax of ORDER BY clause to sort in ascending order:

SELECT COLUMN_NAME1, COLUMN_NAME2 FROM TABLE_NAME ORDER BY COLUMN_NAME ASC;  

- Syntax of ORDER BY clause to sort in descending order:

SELECT COLUMN_NAME1, COLUMN_NAME2 FROM TABLE_NAME ORDER BY COLUMN_NAME DESC;